Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: ཤི་རི་ཤི་རི། ག་ཤི་རི། ག་བི་ཤི་རི། སྭ་སྟི་སརྦ་སཏྭཱ་ནཱཾ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་དགུའི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་དགུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཆང་ན། འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ།
en: “Noble one, for the bodhisattva mahāsattva who is on the ninth bodhisattva bhūmi, the dhāraṇī called infinite adornment will arise and be obtained: tadyathā | haricaṇḍalike kulamābhate toraśipata patasi śiri śiri gaśiri gaviśiri svasti sarvasatvānāṃ svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in nine Ganges Rivers will protect the bodhisattvas on the ninth bhūmi.

source: ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཙེ་བ་དང་། གཟའ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་ཀྱང་རྣམ་པར་གྲོལ་ཏེ། ས་དགུ་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་བཅུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཟད་མི་ཤེས་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་འདི་སྐྱེ་སྟེ། གཟུངས་ལ། ཏདྱ་ཐཱ། སིདྡྷེ་སུདྡྷེ། མོ་ཙ་ནི། མོ་ཀྵ་ནི། མུཀྟེ། བི་མུཀྟེ། ཨ་མ་ལེ། བི་མ་ལེ། ད་མ་ལེ། མཱངྒ་ལེ། ཧི་ར་ཎྱ་གརྦྷེ། རཏྣ་གརྦྷེ། ས་མནྟ་བྷ་དྲེ། སརྦ་ཨརྠཱ། སཱ་དྷ་ནི། མ་ན་སི་མ་ཧཱ་མ་ན་སི། ཨདྡྷུ་ཏེ། ཨ་ཏྱདྡྷུ་ཏེ། ཨ་ར་ཛེ། བི་ར་ཛེ། ཨུ་ཙྱུཏེ། ཨ་མྲཱྀ་ཏེ། ཨ་ར་ཛེ།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the ninth bhūmi.

source: བི་ར་ཛེ། བྲ་ཧྨེ་བྲ་ཧྨ། སཱ་རེ་པཱུ་ར་ཎི་པཱུ་ར་ཎ། མ་ནོ་ར་ཐེ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་བཀྲ་ཤིས་པ་དང་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་སྟེ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་བཅུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཆང་ན། འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ། ཕ་རོལ་གྱི་དགྲ་དང་།
en: “Noble one, for the bodhisattva mahāsattva who is on the tenth bodhisattva bhūmi, the dhāraṇī called the unceasing casket will arise and be obtained: tadyathā | siddhe susiddhe mocani mokṣani mukte vimukte amale vimale damale māṅgale hiraṇyagarbhe ratnagarbhe samantabhadre sarvārtha sādhana manasi mahāmanasi adbhute atyadbhute araje viraje ucyute amṛte araje viraje brahme brahma sārwpūraṇi pūraṇa manorathe svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in ten Ganges Rivers will protect the bodhisattvas on the tenth bhūmi.

source: སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཙེ་བ་དང་། གཟའ་དང་། གདུག་པ་ཅན་ཐམས་ཅད་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལ་སོགས་པ་ལས་རྣམ་པར་གྲོལ་ཏེ། ས་བཅུ་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the tenth bhūmi.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེའི་ཏོག་གི་འོད་ཟེར་སྣང་བ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བས། བཅོམ་ལྡན་འདས་ཀྱིས་གཟུངས་འདི་དག་བཤད་པ་ཐོས་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཞབས་ལ་ཕྱག་འཚལ་ཏེ་ཚིགས་སུ་བཅད་པ་འདིས་བསྟོད་དོ། །ཟབ་མོ་མཚན་ཉིད་མེད་ཆོས་ལ། །སྐྱེ་བོ་ཤེས་པ་ཉམས་པ་རྣམས། །བཅོམ་ལྡན་ཉག་གཅིག་སྒྲོལ་མཛད་པ། །དཔེ་མེད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Then the bodhisattva mahāsattva by the name of Unobstructed Appearance of the Light of a Lion’s Ornament, having heard the Bhagavat teach those dhāraṇīs, rose from his seat and, with his upper robe over one shoulder, knelt on his right knee, placed his palms together in homage, bowed down to the Bhagavat’s two feet, and praised him with these verses: “I praise you, who are beyond example, The unique Bhagavat who liberates Beings with weak knowledge In the profound Dharma without characteristics.

source: དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་སྤྱན། །ཆོས་ཀྱི་མཚན་ཉིད་གཅིག་མི་གཟིགས། །
en: “The Tathāgatas’ eyes of wisdom Do not see a single characteristic of phenomena.

source: ཡང་དག་ཆོས་ཀྱི་སྤྱན་གྱིས་ནི། །ཀུན་དུ་གསལ་བ་བསམ་མི་ཁྱབ། །
en: Your eyes of the pure Dharma Have complete, inconceivable clarity.

source: ཆོས་འགའང་སྐྱེ་བ་མེད་པ་སྟེ། །འགོག་པར་ཡང་ནི་མི་འགྱུར་རོ། །
en: “Every phenomenon has no birth, And neither does it cease.

source: དེ་ལྟར་མཉམ་པར་གཟིགས་པས་ན། །བླ་མེད་གནས་སུ་བཞུགས་པར་འགྱུར། །འཁོར་བ་དག་ཀྱང་མི་འཇིག་ལ། །
en: Through seeing equally in that way, One will be in the highest state.

source: མྱ་ངན་འདས་ལའང་མི་བཞུགས་ཤིང་། །མཐའ་གཉིས་ལ་ནི་མི་གནས་ཏེ། །དེའི་ཕྱིར་མྱ་ངན་འདའ་བ་བརྙེས། །
en: “Not being terrified of saṃsāra, Or remaining in nirvāṇa— Not dwelling in the two extremes— In that way nirvāṇa is attained.

source: དག་དང་མ་དག་ཕྱོགས་ལ་ཡང་། །རྣམ་པར་དབྱེ་བ་མེད་པའི་ཕྱིར། །བཅོམ་ལྡན་རོ་གཅིག་མཁྱེན་པས་ན། །རྣམ་པར་དག་པའི་མཆོག་བརྙེས་སོ། །
en: “Because you make no distinction Between that which is pure and impure, The Bhagavat knows one taste And has attained supreme purity.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཚད་མེད་སྐུས། །ཚིག་གཅིག་སྟོན་པ་མེད་པར་ཡང་། །འཁོར་མང་འདི་དག་ཐམས་ཅད་ལ། །ཆོས་ཀྱི་ཆར་གྱིས་ཚིམ་པར་མཛད། །
en: “The immeasurable body of the Bhagavat Does not teach even a single word, And yet a rain of Dharma brings satisfaction To the entire multitude of this assembly.

source: སེམས་ཅན་འདི་དག་ཐམས་ཅད་ཀྱི། །མཚན་ཉིད་རྣམ་པར་གཟིགས་མེད་ཀྱང་། །ཉོན་མོངས་སྡུག་བསྔལ་ཐམས་ཅད་ལས། །བཅོམ་ལྡན་རྟག་ཏུ་སྐྱོབ་པར་མཛད། །
en: “Although he does not see the Characteristics of all these beings, The Bhagavat always protects them From all kleśas and suffering.

source: བདེ་དང་སྡུག་བསྔལ་རྟག་མི་རྟག །བདག་དང་བདག་མེད་ལ་སོགས་དང་། །གཅིག་དང་ཐ་དད་མ་ཡིན་དང་། །སྐྱེ་བ་མེད་དང་འགོག་མེད་པའི། །
en: “There is no happiness or suffering No permanence or impermanence, Self or selflessness, and so on; no singleness Or multiplicity; and no birth or cessation.

source: དེ་འདྲའི་དོན་གྱི་རྣམ་པ་ལ། །རྣམ་པར་དབྱེ་ཞིང་སྟོན་པར་མཛད། །
en: “He teaches and elucidates That kind of meaning.

source: དཔེར་ན་བྲག་ཅ་སྟོང་པར་ནི། །དེ་དོན་སངས་རྒྱས་རྣམས་ཀྱིས་མཁྱེན། །
en: The buddhas know this meaning, Which is like an empty echo.

source: ཆོས་ཀྱི་དབྱིངས་ནི་དབྱེར་མེད་པས། །ཐེག་པ་མི་མཐུན་གཞན་མེད་དེ། །སེམས་ཅན་རྣམས་ནི་བསྒྲལ་བའི་ཕྱིར། །གསུམ་དུ་རྣམ་པར་དབྱེ་བ་མཛད། །
en: “As the Dharma realm is indivisible, There are no other contradictory yānas, But he has made the division into three In order to liberate beings.”

source: དེ་ནས་ཚངས་པའི་རྒྱལ་པོ་དབང་ཕྱུག་ཆེན་པོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཤིན་ཏུ་དཀོན་ཞིང་། དཔག་པར་དཀའ་བ། ཐོག་མར་ཡང་དགེ་བ།
en: Then Maheśvara, the king of the Brahmā devas, rose from his seat and, with his upper robe over one shoulder, knelt on his right knee, placed his palms together in homage, bowed down to the Bhagavat’s two feet, and said to the Bhagavat, “This Lord King of Sūtras, the Sublime Golden Light, is very rare; it is beyond evaluation.

source: བར་དུ་ཡང་དགེ་བ། ཐ་མར་ཡང་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ་ཡོངས་སུ་རྫོགས་པ།
en: It is good in the beginning, good in the middle, and good in the end; it has a good meaning; it has good words; it is unmixed and perfect; and it makes perfect all the Buddhadharma.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཛད་པ་འདི་གང་ཞིག་འཆང་བ་དང་། འཛིན་པ་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མཛད་པ་གཟོ་བ་ལགས་སོ། །
en: Whoever possesses and holds it is someone who fulfills the deeds of the buddha bhagavats.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: “Noble one, it is as you have said,” replied the Bhagavat.

source: རིགས་ཀྱི་བུ་གང་མདོ་སྡེ་འདི་ཉན་པར་བྱེད་པ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: “Noble one, whoever listens to this sūtra will progress irreversibly to the highest, most complete enlightenment.

source: རིགས་ཀྱི་བུ་འདིས་ནི། ས་ལས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་མཆོག་ཏུ་སྨིན་པར་བྱེད་པ་དང་། ཆོས་ཀྱི་ཕྱག་རྒྱ་དམ་པ་ཡིན་པ་དང་། མདོ་སྡེ་ཀུན་གྱི་རྒྱལ་པོར་གྱུར་པ་སྟེ།
en: Noble one, it ripens the supreme roots of merit of the bodhisattvas who are irreversibly upon the bhūmis, it is the sublime seal of the Dharma, and it is the king of all sūtras.

source: དེའི་ཕྱིར་མཉན་པ་དང་། གཟུང་བ་དང་། བཀླག་པ་དང་། གདོན་པར་བྱའོ། །
en: Therefore, it should be listened to, obtained, read, and recited.

source: དེ་ཡང་རིགས་ཀྱི་བུ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་མ་སྨིན་པ་དང་། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་མ་བྱས་པའི་སེམས་ཅན་དེ་དག་གིས་ནི་དམ་པའི་ཆོས་འདི་མཉན་པར་མི་ནུས་སོ། །
en: “Noble one, beings who have not planted roots of merit, who have not ripened their roots of merit, and who have not served many buddhas will not be able to hear this sublime Dharma.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པ་ཙམ་གྱིས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དག་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་ཅིང་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་འགྱུར་རོ། །
en: “Noble one, just by hearing this Dharma teaching, noble sons or noble daughters will have a higher motivation and will never be apart from seeing the buddhas.

source: དམ་པའི་ཆོས་ཉན་པ་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from hearing the sublime Dharma.

source: དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from honoring the saṅgha.

source: རྒྱ་མཚོའི་ཕྱག་རྒྱ་མི་ཟད་པ་མངོན་པར་བསྒྲུབ་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī of the accomplishment of the unceasing seal of the ocean.

source: སེམས་ཅན་གྱི་བསམ་པ་དང་། སྤྱོད་པ་དང་། སྒྲ་ལ་འཇུག་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī of engaging in the motivations, conduct, and languages of beings.

source: ཉི་མའི་ཏོག་སྣང་བའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī of the shining crest of the sun.

source: ཟླ་བའི་ཏོག་སྣང་བའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར། ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་རྣམ་པར་གནོན་པ་བསྒྲུབ་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī of accomplishing the suppression of all that arises.

source: རྡོ་རྗེ་ལྟར་སྲ་ཞིང་བརྟན་པའི་རི་རྣམ་པར་འཇོམས་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī that is as hard as a vajra and destroys mountains.

source: བརྗོད་དུ་མེད་པའི་དོན་བསྟན་པ་ལ་ཡང་དག་པར་གཞོལ་བའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར། ཚིག་དང་སྤྱོད་པ་དང་།
en: They will never be apart from the dhāraṇī that enters into the teaching of the inexpressible meaning.

source: སྒྲ་ཐམས་ཅད་ལ་འཇུག་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī that engages in all languages.

source: ནམ་མཁའི་དཀྱིལ་འཁོར་དྲི་མ་མེད་པ་བསྒྲུབ་པའི་ཕྱག་རྒྱས་བཏབ་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར།
en: They will never be apart from the dhāraṇī that applies the seal of the accomplishment of the stainless domain of space.

source: སངས་རྒྱས་ཀྱི་སྐུ་མཐའ་ཡས་པ་ཡོངས་སུ་རྫོགས་པ་བསྒྲུབ་པའི་གཟུངས་དང་མི་འབྲལ་བར་འགྱུར་རོ། །
en: They will never be apart from the dhāraṇī that accomplishes the complete, infinite body of a buddha.

source: ལྷའི་བུ་གཟུངས་འདི་དག་ཐོབ་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་སངས་རྒྱས་ཀྱི་སྐུ་མངོན་པར་སྤྲུལ་ནས་ཆོས་སྟོན་ཏོ། །
en: “Son of the devas, through obtaining these dhāraṇīs, the bodhisattvas emanate buddha bodies into the buddha realms in the ten directions and teach the Dharma.

source: ཆོས་ཉིད་ལས་ཀྱང་མི་གཡོ་ལ། འགྲོ་བ་ཡང་མེད། འོང་བ་ཡང་མེད་དོ། །
en: They will not deviate from the true nature, with no going and no coming.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་། སེམས་ཅན་དུ་དམིགས་པ་ཡང་མེད་དོ། །
en: They will ripen beings without having a perception of beings.

source: ཆོས་སྟོན་ཀྱང་ཡི་གེ་མཉམ་པ་ཉིད་ལས་གཡོ་བ་མེད་དོ། །
en: They will teach the Dharma without deviating from the sameness of all words.

source: འཆི་འཕོ་བ་དང་སྐྱེ་བ་སྟོན་ཀྱང་འཕོ་བ་ཡང་མེད། སྐྱེ་བ་ཡང་མེད་དོ། །
en: Although they manifest death and birth, they do not pass away, and have no birth.

source: ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར། འདུ་བྱེད་རྣམས་གང་དུ་ཡང་འགྲོ་བར་མི་འགྱུར། གང་ནས་ཀྱང་འོང་བར་ཡང་མི་འགྱུར་རོ། །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན།
en: Because they have no thoughts toward all phenomena, that which is composite does not go anywhere and does not come from anywhere.”

source: བྱང་ཆུབ་སེམས་དཔའ་སུམ་སྟོང་གིས། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་པ་རྣམས་ཀྱིས་ནི། བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །དགེ་སློང་དང་། དགེ་སློང་མ་ཚད་མེད་པ་རྣམས་ཀྱིས་ནི། ཆོས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པ་ཐོབ་བོ། །སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱིས་ནི།
en: When this Dharma teaching was given, three thousand bodhisattvas attained patience toward the quality of birthlessness; innumerable bodhisattvas became irreversible from the enlightenment mind; innumerable bhikṣus and bhikṣuṇīs attained the pure Dharma eyes for the Dharma; and innumerable beings developed the aspiration for the highest, most complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་པ་དང་། དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །འཁོར་བའི་རྒྱུན་གཅོད་དམ་ཆོས་འདི། །ཟབ་ཅིང་ཕྲ་ལ་བལྟ་དཀའ་སྟེ། །
en: Then, at that time, the Bhagavat recited this verse: “This sublime Dharma that stops saṃsāra Is profound, subtle, and difficult to see.

source: འདོད་པས་བསྒྲིབས་པའི་དམུས་ལོང་དག །དེ་མ་མཐོང་བས་སྡུག་བསྔལ་ལེན། །
en: Those who are blind, obscured by desire, Will not see it and will acquire suffering.”

source: དེ་ནས་འཁོར་འདུས་པ་དེ་དག་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཀློག་ཅིང་འདོན་པ་དང་། སྟོན་ཅིང་གནས་པ་དེར་བདག་ཅག་ཐམས་ཅད་མཆིས་ནས། ཆོས་སྟོན་པའི་འཁོར་དུ་བགྱིས་ཏེ།
en: That gathered assembly then rose from their seats, bowed their heads to the Bhagavat’s feet, and said, “Bhagavat, we will go to where someone is reading, reciting, or teaching this Lord King of Sūtras, the Sublime Golden Light, and we will form the assembly for that Dharma teacher and will benefit him, bestow happiness upon him, and make him physically and mentally happy.

source: དེ་ལ་ཕན་པ་དང་། བདེ་བ་སྩལ་ཅིང་ལུས་དང་སེམས་བདེ་བར་བགྱིའོ། །བདག་ཅག་གིས་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པས་མཆོད་པར་བགྱིའོ། །ཉན་པའི་འཁོར་རྣམས་ཀྱང་བདེ་བས་ཚིམ་པར་བགྱིའོ། །
en: We will, with single-pointed minds, make offerings to him, and we will satisfy with happiness the assembly that listens to him.

source: རྒྱལ་པོའི་ཡུལ་དེར་ཡང་ཕ་རོལ་གྱི་དགྲའི་འཇིགས་པ་དང་། འཚེ་བ་དང་། མུ་གེའི་ཡ་ང་བས་སྡུག་བསྔལ་བ་མ་མཆིས་པ་དང་།
en: In the land of that king there will be no suffering because of fear of invading enemies, violence, or the anxiety of famine.

source: སྐྱེ་བོ་མང་པོས་རྒྱས་ཤིང་ཡོངས་སུ་དར་བར་བགྱིའོ། །ཆོས་འདི་བཤད་པའི་གནས་ཀྱི་དཀྱིལ་འཁོར་འདི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་ལ་སོགས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མི་བརྫི་ཞིང་གཙང་མར་བགྱིའོ། །
en: The people will multiply and spread.

source: ཆོས་བཤད་པའི་གནས་འདི་ནི་མཆོད་རྟེན་ལགས་པའི་སླད་དུ། གདུགས་དང་། རྒྱལ་མཚན་དང་། མེ་ཏོག་དང་།
en: We will make offerings as to a stūpa, with parasols, banners, flowers, incense, and ornaments, to this place where the Dharma is taught.

source: བདུག་པ་དང་། ལྷབ་ལྷུབ་ཀྱིས་ཡོངས་སུ་མཆོད་པར་བགྱིའོ། །བདག་ཅག་གིས་ཀྱང་རྟག་ཏུ་བསྲུང་ཞིང་བསྐྱབས་ཏེ་ཉམས་པ་མ་མཆིས་པར་བགྱིའོ། །
en: We will always protect it so that it will not deteriorate.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་འདུས་པ་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱེད་ཀྱིས་མདོ་སྡེ་དམ་པ་འདི་བསྒྲུབ་པ་ལ་བརྩོན་པར་གྱིས་ཤིག་དང་། དམ་པའི་ཆོས་འདི་འཇིག་རྟེན་འདིར་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ། །
en: Then the Bhagavat said to that gathered assembly, “Noble ones, be diligent in accomplishing this sublime sūtra, and this sublime Dharma will remain for a long time in this world.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། ས་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བའི་ལེའུ་ཞེས་བྱ་སྟེ་དྲུག་པའོ།། །།
en: This concludes “The Purification of the Bhūmis,” the sixth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: བམ་པོ་ལྔ་པ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་གསེར་གྱི་ལག་པའི་དབང་པོ་ཞེས་བྱ་བ་དེས།
en: Chapter 7: A Praise of All the Realms of the Past, Future, and Present Samyaksaṃbuddhas Then the Bhagavat said to the noble goddess Bodhisattvasamuccayā, “Noble goddess, at that time, in that time, there was a king by the name of Suvarṇabhujendra.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྟོད་པ། པདྨོའི་འབྱུང་གནས་འདིས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མངོན་པར་བསྟོད་དོ། །
en: Through this praise of all the tathāgatas, The Source of Lotus Flowers, he praised the buddha bhagavats of the past, future, and present.

source: རྒྱལ་བ་གང་དག་སྔར་འགྱུར་གང་བྱུང་དང་། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ན་གང་འཚོ་བ། །རྒྱལ་བ་དེ་དག་རྣམས་ལ་ཕྱག་བགྱིའོ། །རྒྱལ་བ་དེ་དག་ཀུན་ལ་བདག་གིས་བསྟོད། །
en: “ ‘The jinas who have appeared in the past, And the jinas present in worlds in the ten directions, I pay homage to those jinas And I praise all those jinas.

source: ཐུབ་དབང་ཞི་ཞིང་རབ་ཞི་རྣམ་པར་དག །
en: “ ‘A lord of munis is peaceful, totally peaceful, and pure.

source: སྐུ་ནི་གསེར་གྱི་མདོག་ཏུ་རབ་ཏུ་གདའ། །
en: His body is a perfect golden color.

source: དབྱངས་རྣམས་ཀུན་པས་སངས་རྒྱས་གསུང་སྙན་ཏེ། །ཚངས་པའི་སྒྲ་དབྱངས་རབ་ཏུ་བསྒྲགས་པའི་གསུང་། །
en: A buddha’s speech is pleasant with every utterance, A speech that resounds like the voice of Brahmā.

source: བུང་བ་རྨ་བྱ་ཨུཏྤལ་སྔོན་པོའི་དབུ། །མཐོན་མཐིང་ལྕང་ལོ་བྱ་ནི་ཙ་ཤ་འདྲ། །
en: “ ‘He has hair like a bee, a peacock, and a blue lotus, With dark blue curls like the blue jaybird.

source: ཁ་བ་དུང་ལྟར་རབ་ཏུ་དཀར་བའི་ཚེམས། །རྟག་ཏུ་གསེར་ལྟར་རྣམ་པར་མཛེས་པར་གདའ། །
en: His teeth are pure white like snow or a conch, And he is always beautiful like gold.

source: སྤྱན་ནི་རིང་ཞིང་མཐོན་མཐིང་དྲི་མ་མེད། །ཨུཏྤལ་སྔོན་པོ་རབ་ཏུ་རྒྱས་པ་འདྲ། །
en: “ ‘His eyes are long, dark blue, and stainless; They are like blossomed blue lotuses.

source: ལྗགས་ནི་ཆེ་ཞིང་ལེགས་པ་པདྨའི་མདོག །པདྨ་འདྲར་སྣང་པདྨའི་ཟེ་བ་འདྲ། །
en: His broad, excellent tongue is the color of a red lotus, Glowing like a red lotus, like red-lotus anthers.

source: ཞལ་གྱི་མཛོད་སྤུ་པད་རྩ་དུང་དང་འདྲ། །བཻ་ཌཱུརྱ་ཡི་མདོག་འདྲ་གཡས་སུ་འཁྱིལ། །
en: “ ‘The ūrṇā hair on his face is the color of a conch or lotus root; It curls to the right and is the color of white beryl.

source: ཐུབ་པའི་སྐུ་ནི་ཟླ་བ་ཕྲ་འདྲ་ཞིང་། །ཟླ་བ་ཟད་འདྲ་སྤྱན་བཀྲག་བུང་བ་བཞིན། །
en: The Muni’s body is like a sliver of the moon, The Muni’s crescent eyes are the color of a carpenter bee.

source: ཞལ་མཐོ་ཤངས་ནི་རྟག་ཏུ་ལྷང་ངེ་སྟེ། །འཇམ་ཞིང་ས་ཡི་གསེར་ལྟར་ཁ་དོག་བཟང་། །
en: “ ‘His face has a high nose that is always prominent And is soft and an excellent color, like bright gold.

source: རྟག་པར་རྒྱུན་དུ་རྒྱལ་བ་ཐམས་ཅད་ཀྱི། །རོ་མཆོག་འཇམ་ཞིང་དམ་པའི་མཆོག་རབ་འཕགས། །
en: He always, continuously, has the perfect nose of all the jinas, Which is soft, sublime, supreme, and noble.

source: སྤུ་ཡི་བུ་ག་ནས་ནི་རེ་རེ་སྐྱེས། །སྤུ་རྣམས་སྐྱེས་པ་གཡས་སུ་འཁྱིལ་པ་སྟེ། །མཐོན་མཐིང་འདྲ་བར་འཚེར་ཞིང་ལྕང་ལོ་ཅན། །རྨ་བྱའི་མགྲིན་སྡུག་འདྲ་བར་སྔོ་ལ་མཛེས། །
en: “ ‘From each and every pore there Rises a hair that curls to the right, A dark blue, shining, gleaming curl, Blue and beautiful like a peacock’s neck.

source: བལྟམས་མ་ཐག་ཏུ་སྐུ་ཡིས་སྣང་བར་བགྱིས། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ནི་ཐམས་ཅད་གང་། །འཇིག་རྟེན་གསུམ་ན་སྡུག་བསྔལ་མཐའ་ཡས་ཞི། །བདེ་བ་ཀུན་གྱིས་སེམས་ཅན་རྣམས་ཀྱང་ཚིམ། །
en: “ ‘As soon as he was born, his body shone, Filling all worlds in the ten directions with light, Ending the endless sufferings in the three worlds, And satisfying beings with every happiness.

source: སེམས་དམྱལ་འགྲོ་དང་དུད་འགྲོར་འགྲོ་བ་དང་། །ཡི་དགས་ལྷ་གནས་མི་ཡི་འགྲོ་རྣམས་སུ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་བདེ་བས་ཚིམ། །ངན་སོང་འགྲོ་བ་རྣམས་ནི་ཐམས་ཅད་ཞི། །
en: “ ‘He satisfied with happiness The beings in the hells, animals, Pretas, devas, and human beings, And brought to an end all lower existences.

source: ཁ་དོག་བཟང་བ་གསེར་དང་འདྲ་བའི་འོད། །བཙོ་མའི་གསེར་ལྟར་རབ་ཏུ་སྣང་བའི་སྐུ། །
en: “ ‘His light was the excellent color of gold; His body shone like purified gold.

source: བདེ་གཤེགས་ཟླ་བ་རབ་ཏུ་དྲི་མེད་ཞལ། །འཛུམ་ཞིང་རྣམ་མཛེས་ཤིན་ཏུ་དྲི་མེད་ཞལ། །
en: His perfectly stainless face is a sugata moon, His stainless mouth smiling beautifully.

source: གཞོན་ནུ་བཙས་འདྲར་སྐུ་ལུས་ཡན་ལག་འཇམ། །
en: “ ‘His body and limbs are soft like a young boy’s.

source: སེང་གེ་འདྲ་བར་རྩལ་གྱིས་གནོན་པའི་མཆོག །
en: He has a perfect, powerful stride like a lion’s.

source: ཕྱག་རིང་ཕྱག་ནི་རབ་ཏུ་རིང་བ་སྟེ། །སཱ་ལའི་ལྕུག་མ་རླུང་གིས་བསྐྱོད་པ་བཞིན། །
en: He has long hands and very long arms Like vines on a sal tree moved by the breeze.

source: འདོམ་གང་འོད་འབར་འོད་ཟེར་རབ་ཏུ་གཏོང་། །ཉི་མ་སྟོང་ལྟར་རབ་ཏུ་ལྷང་ངེའོ། །
en: “ ‘He has a fathom-wide aura that radiates light; He is as bright as a thousand suns.

source: ཐུབ་པའི་དབང་པོའི་སྐུ་མཆོག་དྲི་མ་མེད། །ཞིང་རྣམས་མཐའ་ཡས་ཐམས་ཅད་རབ་ཏུ་སྣང་། །
en: The stainless, supreme body of the lord of munis Illuminates all of the infinite realms.

source: སངས་རྒྱས་འོད་ནི་རྣམ་པར་ལྷང་ངེ་བས། །ཞིང་རྣམས་མཐའ་ཡས་བརྒྱ་སྟོང་རྣམས་སུ་ཡང་། །མཚན་བྱད་ཟླ་བ་ཉི་མ་མང་པོ་དག །དེ་དག་ཐམས་ཅད་འོད་ནི་མེད་པར་འགྱུར། །
en: “ ‘A multitude of night-bringing moons and suns, In endless hundreds of thousands of realms, All become eclipsed by The brilliant light of the Buddha.

source: སངས་རྒྱས་ཉི་མ་འཇིག་རྟེན་སྒྲོན་མ་སྟེ། །སངས་རྒྱས་ཉི་མ་བརྒྱ་ཕྲག་སྟོང་རྣམས་ནི། །ཞིང་རྣམས་མཐའ་ཡས་སྟོང་ཕྲག་བརྒྱ་དག་ན། །དེ་བཞིན་གཤེགས་པའི་ཉི་མ་སེམས་ཅན་མཐོང་། །
en: “ ‘In endless hundreds of thousands of realms May beings see the tathāgata suns— The suns of the buddhas, the lamps of worlds— As a hundred thousand buddha suns.

source: བསོད་ནམས་སྟོང་ཕྲག་བརྒྱ་དང་ལྡན་པའི་སྐུ། །
en: “ ‘His body is endowed with a hundred thousand merits.

source: ཡོན་ཏན་ཀུན་གྱིས་རབ་ཏུ་བརྒྱན་པའི་སྐུ། །
en: His body is adorned by all good qualities.

source: གླང་ཆེན་དབང་པོའི་སྣ་འདྲ་རྒྱལ་བའི་ཕྱག །
en: The Jina’s arms are like the trunk of the king of elephants.

source: ཕྱག་དང་ཞབས་འོད་རབ་མཛེས་དྲི་མ་མེད། །ས་ཡི་སྟེང་གི་རྡུལ་དང་མཚུངས་འདྲ་སྙེད། །ཕྲ་བའི་རྡུལ་སྙེད་སངས་རྒྱས་གང་འདས་དང་། །གང་དག་ཕྲ་བའི་རྡུལ་སྙེད་བྱུང་བ་དང་། །
en: His hands and feet are beautiful with stainless light.

source: གང་དག་ཕྲ་བའི་རྡུལ་སྙེད་བཞུགས་པ་ཡི། །རྒྱལ་བ་དེ་དག་ལ་ནི་རབ་དང་བའི། །ངག་ཡིད་ལུས་ཀྱིས་མེ་ཏོག་དབུལ་བ་དང་། །སྤོས་རྣམས་དབུལ་དང་བསྔགས་པ་བརྒྱ་དག་དང་། །དགེ་བའི་སེམས་ཀྱིས་ཀྱང་ནི་ཕྱག་འཚལ་ལོ། །
en: “ ‘The buddhas who have been, who are as numerous as atoms, Who are as numerous as the dust on the surface of the earth; Those who are will be, who are as numerous as atoms; And those who are present, who are as numerous as atoms— “ ‘To those jinas I pay homage In pure faith, with body and speech, Offering flowers and offering perfumes, And with a hundred praises and a virtuous mind.

source: རྒྱལ་བའི་ཡོན་ཏན་གང་དག་དགེ་གྱུར་པ། །སྙིང་པོ་མཆོག་རབ་སྣ་ཚོགས་དུ་མ་སྟེ། །
en: “ ‘The good qualities that the jinas have Are a manifold multitude of the very best.

source: བདག་གིས་བསྐལ་པ་སྟོང་དུ་ལྕེ་བརྒྱ་ཡིས། །སངས་རྒྱས་ཡོན་ཏན་བརྗོད་པར་མི་ནུས་སོ། །
en: I could not describe those qualities of the jinas In a thousand eons with a hundred tongues.

source: རྒྱལ་བ་གཅིག་གི་ཡོན་ཏན་རྣམས་ཀྱང་ནི། །ལྕེ་སྟོང་གིས་ཀྱང་ཅུང་ཟད་བརྗོད་མི་ནུས། །བདག་གིས་རྒྱལ་བ་དག་ནི་ཐམས་ཅད་ཀྱི། །ཡོན་ཏན་གཅིག་རྒྱས་བརྗོད་པར་ག་ལ་ནུས། །
en: “ ‘With a thousand tongues I could not describe Even a fraction of the qualities of a single jina, So how could I describe with a thousand tongues The qualities of all the jinas?

source: ལྷར་བཅས་འཇིག་རྟེན་ཐམས་ཅད་མཚོར་གྱུར་ཏེ། །སྲིད་པའི་རྩེ་མོ་མན་ཆད་ཆུས་གང་བ། །སྐྲ་ཡི་རྩེ་མོས་དཔག་པར་ནུས་སྲིད་ཀྱིས། །བདེ་གཤེགས་རྣམས་ཀྱི་ཡོན་ཏན་གཅིག་ལ་མིན། །
en: “ ‘If the world and its paradises became an ocean, And up to the summit of existence became filled with water, It would be possible to measure that with the tip of a hair, But one cannot measure a single quality of the sugatas.

source: ལུས་དང་ངག་དང་ཡིད་རབ་དང་བ་ཡིས། །རྒྱལ་བ་ཀུན་ལ་བདག་གིས་བསྔགས་བསྟོད་པས། །
en: “ ‘With faith and with body, speech, and mind I praise and eulogize all the jinas.
